// 1.
// На входе значение. Необходимо его обработать. Если это число
//  и оно не является
// четным, бросить исключение


// let number = "1";
// let number1 = 2;

// function iseven(number) {
//     try {
//         if (!isNaN(number) && number % 2 === 0 ) {
//             return true;
//         }
//         throw new TypeError("is not even");
//     }
//     catch (error) {
//         return error.message;
//     }
// }

// let result = iseven(number);
// alert(result);


// 2.
// На входе массив значений. Необходимо его обработать. Если в массиве есть хотя
// бы 1 строка, бросить исключение.


// 3.
// Дана строка массива чисел. Необходимо спарсить строку. 
// Если же после того как
// // вы спарсили данные у вас не массив бросить исключение. 
// Добавить проверку
// на числа. Далее вывести только те числа, которые кратны 3


let arr = [12,33,44,55,66,"fddgf"];